proj/app/views/presentations/show.html.erb

        <h5 class="card-title">Evaluations</h5>
        <% @presentation.evaluations.each do |evaluation| %>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."presentation_id" = $1  [["presentation_id", 1]]

    <div class="mt-3">
      <% if @presentation.grade.present? %>
---
SELECT "grades".* FROM "grades" WHERE "grades"."presentation_id" = $1 LIMIT $2  [["presentation_id", 2], ["LIMIT", 1]]