proj/app/controllers/courses_controller.rb

SELECT "presentations".* FROM "presentations" WHERE "presentations"."course_id" = $1 ORDER BY "presentations"."presentation_date" DESC  [["course_id", 1]]
---
  def show
    authorize @course
    @presentations = @course.presentations.order(presentation_date: :desc)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def update
    @course = Course.find(params[:id])