proj/app/controllers/evaluations_controller.rb

  def create
    @evaluation = @presentation.evaluations.new(evaluation_params)
    @evaluation.evaluator = current_user
    authorize @evaluation

    if @evaluation.save
      redirect_to course_presentation_path(@presentation.course, @presentation),
                  notice: 'Evaluation was successfully submitted.'
    else
      redirect_to course_presentation_path(@presentation.course, @presentation),
                  alert: @evaluation.errors.full_messages.join(", ")
---
INSERT INTO "evaluations" ("score", "comments", "presentation_id", "evaluator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 5], ["comments", "Very insightfull"], ["presentation_id", 5], ["evaluator_id", 9], ["created_at", "2024-12-05 15:23:31.827060"], ["updated_at", "2024-12-05 15:23:31.827060"]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def set_presentation
    @presentation = Presentation.find(params[:presentation_id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]