proj/app/controllers/grades_controller.rb

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "grades" WHERE "grades"."presentation_id" = $1 LIMIT $2  [["presentation_id", 2], ["LIMIT", 1]]
SELECT "grades".* FROM "grades" WHERE "grades"."presentation_id" = $1 LIMIT $2  [["presentation_id", 2], ["LIMIT", 1]]
---
  def new
    @presentation = Presentation.find(params[:presentation_id])
    if @presentation.grade.present?

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "grades" ("presentation_id", "instructor_id", "score", "feedback", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["presentation_id", 2], ["instructor_id", 4], ["score", "95.0"], ["feedback", "this was manual\n"], ["created_at", "2024-12-04 01:12:15.291165"], ["updated_at", "2024-12-04 01:12:15.291165"]]
---
  def create
    @presentation = Presentation.find(params[:presentation_id])
    @grade = @presentation.build_grade(grade_params)
    @grade.instructor = current_user

    if @grade.save

UPDATE "grades" SET "score" = $1, "feedback" = $2, "updated_at" = $3 WHERE "grades"."id" = $4  [["score", "94.0"], ["feedback", "this was manual, I changed to 94\n"], ["updated_at", "2024-12-04 01:17:39.851385"], ["id", 3]]
---
  def update
    if @grade.update(grade_params)

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_presentation
    @presentation = Presentation.find(params[:presentation_id])