proj/app/controllers/presentations_controller.rb

SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_presentation
    @presentation = Presentation.find(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_course
    @course = Course.find(params[:course_id]) if params[:course_id]