proj/app/views/courses/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 0]]
---
    <p>Use the cmd or shift keys to select multiple students. Unselected students are removed from the course.</p>
    <%= f.collection_select :student_ids, User.where(role: :student), :id, :name, {prompt: true}, {class: "form-control", multiple: true} %>